gematria = {
    'א': 1,
    'ב': 2,
    'ג': 3,
    'ד': 4,
    'ה': 5,
    'ו': 6,
    'ז': 7,
    'ח': 8,
    'ט': 9,
    'י': 10,
    'כ': 20,
    'ל': 30,
    'מ': 40,
    'נ': 50,
    'ס': 60,
    'ע': 70,
    'פ': 80,
    'צ': 90,
    'ק': 100,
    'ר': 200,
    'ש': 300,
    'ת': 400,
    'ך': 20,  # כ סופית
    'ם': 40,  # מ סופית
    'ן': 50,  # נ סופית
    'ף': 80,  # פ סופית
    'ץ': 90   # צ סופית
}


def calc_gematria(word):
    return sum([gematria[char] for char in word])


print(calc_gematria("יאיר"))
